[
  {
    "author_name": "Mike Klas",
    "author_job_role": "Director of Expert Services",
    "author_company": "Talkdesk, Inc. USA",
    "testimonial": "Hibiz has been an invaluable partner throughout my professional journey across Navis, Cargotec, Rootstock, and Talkdesk. From spearheading custom development projects to providing consistent support, their reliability, speed, and competitive rates have remained unmatched. What sets them apart is their genuine commitment to my success, making them a trusted ally rather than just a service provider. With Hibiz, excellence isn't just a promise it's a guarantee."
  },
  {
    "author_name": "Casie Archuleta",
    "author_job_role": "Director, Global Professional Service",
    "author_company": "Talkdesk, Inc. USA",
    "testimonial": "Working with Raj and the exceptional team at Hibiz over the past four years has been nothing short of extraordinary. Hibiz Teams unwavering dedication and technical prowess have made them an invaluable partner, consistently exceeding expectations in tackling any custom solution challenge we bring up. What truly sets Hibiz apart is their collaborative spirit and commitment to being a genuine team player, contributing significantly to the success of our projects. Thank you!"
  },
  {
    "author_name": "John Kepp",
    "author_job_role": "Senior Director, Customer Success",
    "author_company": "Salesforce",
    "testimonial": "I started my 20-year history with HiBiz at Navis.  HiBiz was a successful partner with American President Lines and we leveraged that expertise across the Navis customer base. At Kenandy, we leveraged HiBiz's skill set and resources to build out a complete EDI platform on top of the Salesforce platform for our enterprise showcase account, Del Monte Foods. HiBiz produced an enterprise class EDI platform that was compliant with Salesforces Aloha test/security requirements and the scale required to support a $2B / year EDI based business. At Talkdesk, HiBiz successfully built and maintained an automated dialer that leveraged Twilio API's and the Talkdesk platform that we offered to our global customer base. At Airkit, HiBiz continued their successful support of multiple technologies by assisting Airkit in building out customer specific dashboards and reporting.  HiBiz is a very reliable partner who we can lean on to do turnkey solutions.  HiBiz has been integral to my success across multiple enterprise software companies.  Their ability to adapt to different technology sets and still deliver on a consistent basis is what makes HiBiz stand out.  HiBiz is an accountable company who has become a strategic partner that I can rely on when needed.  I highly recommend HiBiz!"
  },
  {
    "author_name": "Dana Gillon",
    "author_job_role": "Sr. Director, IT & Business Innovation",
    "author_company": "Suntech Medical, Inc. USA",
    "testimonial": "SunTech has greatly benefited from Hibiz's technical expertise in Salesforce and ERP solutions. Their partnership has helped us deliver world class and very cost-effective solutions to our business.  The Hibiz's solution approach combines their deep understanding of the tech platforms, our business requirements, and an innovation-first mindset. Their team works closely with our internal technology team to augment our development capabilities and ramp up our capacity for larger projects.\n\nWorking with Hibiz has helped us resolve our immediate needs and pain points in our tech stack as well as positioned us for future growth through smart and scalable solutions.  I highly recommend Hibiz for their commitment to excellence and their invaluable service."
  },
  {
    "author_name": "Jonathan Bykerk",
    "author_job_role": "Controller of Finance",
    "author_company": "PreBrands, Inc. USA",
    "testimonial": "Hibiz has been a trusted partner for our IT and accounting needs for 5+ years.  I'm always impressed with their range and quality of work all while doing it in a cost-effective manner.  From ERP customization, EDI solutions, and streamlining accounting processes, Hibiz has always worked with us in producing solutions for pain points within the business.  All of this has resulted in savings within our organization and allowed our team to function more efficiently.\n\nHibiz always followed through with their ideas with a quick turnaround time.  I've recommended them to other companies and will continue to do so."
  },
  {
    "author_name": "Yunshui Chen",
    "author_job_role": "Founder & CEO",
    "author_company": "AIRSYS Greer, SC, USA",
    "testimonial": "Hibiz, An Unparalleled Partner in Airsys's Journey to be a global player and innovator.\n\nAs the founder and CEO of Airsys, a global player in Datacenter cooling solutions, I value  Hibiz as my partner to great success. Their unwavering commitment to excellence has set them apart in the industry.\n\nFrom spearheading our Digital Transformation initiatives, Salesforce, ERP and Artificial Intelligence/Gen AI, and executing custom development projects, Hibiz has consistently delivered beyond expectations. Their reliability, speed, and competitive rates remain unmatched.\n\nBut what truly distinguishes Hibiz is their genuine dedication to Airsys's success. They are not just a service provider, they are a trusted partner. With Hibiz, excellence isn't merely a slogan -it's a certainty!"
  },
  {
    "author_name": "Caroline Santander",
    "author_job_role": "Senior Vice President",
    "author_company": "Global Professional Services and Enablement, Rootstock Software",
    "testimonial": "I have worked with Raj and Hibiz for many years, during which they had proven to be a reliable, trustworthy, accountable business partner. Two companies I work(ed) for have been using the talent Raj has grown at Hibiz for development, both custom and product, as well as various other roles.\nHibiz team always deliver, and the result is always on time and of high quality. It is so rare to see tenure as long as with the team they have built in India. This to me shows that Hibiz leadership manages their talent very well and knows how to keep them to build further talent. Hibiz is highly successful working with many customers on very varied projects and technologies.\nBeyond the trust that Hibiz has built, they are a wonderful group of people to deal with in business. I highly recommend Hibiz!"
  }
]